In [6]:
import numpy as np
import pandas as pd

## Seriesを作成する

In [4]:
# dictionaryから作成
data = {
    '名前': 'ルフィ',
    '性別': '男', 
    '年齢': '１９', 
}

In [5]:
pd.Series(data)

名前    ルフィ
性別      男
年齢     １９
dtype: object

In [11]:
# numpy arrayから作成
array = np.array([1991, 2001, 2011, 2021])
year_series = pd.Series(array)
year_series

0    1991
1    2001
2    2011
3    2021
dtype: int64

In [ ]:
# Seriesから値を取ってくる
year_series.values

In [15]:
year_series.mean()

2006.0

In [9]:
array = np.array(['ルフィ', '男', 19])
luffy_series = pd.Series(array, index=['名前', '性別', '年齢'])
luffy_series

名前    ルフィ
性別      男
年齢     19
dtype: object

In [10]:
luffy_series['名前']

'ルフィ'

## DataFrameを作成する

### pd.DataFrame()

In [16]:
# numpy arrayから作成
ndarray = np.arange(10).reshape(2, 5)
ndarray

array([[0, 1, 2, 3, 4],
       [5, 6, 7, 8, 9]])

In [19]:
pd.DataFrame(ndarray, index=['index1', 'index2'], columns=['a', 'b', 'c', 'd', 'e'])

        a  b  c  d  e
index1  0  1  2  3  4
index2  5  6  7  8  9

In [22]:
# dictionaryから作成
data1 = {
    '名前': 'ルフィ',
    '性別': '男',
    '年齢': '１９', 
}
data2 = {
    '名前': 'ゾロ',
    '性別': '男',
    '年齢': '２１', 
}
data3 = {
    '名前': 'ナミ',
    '性別': '女',
    '年齢': '２０', 
}
pd.DataFrame([data1, data2, data3])

    名前 性別  年齢
0  ルフィ  男  １９
1   ゾロ  男  ２１
2   ナミ  女  ２０

In [68]:
data = {
    '名前': ['ルフィ', 'ゾロ', 'ナミ'],
    '性別': ['男', '男', '女'],
    '年齢': ['１９', '２１', '２０'],
}
df_pirate = pd.DataFrame(data)
df_pirate

    名前 性別  年齢
0  ルフィ  男  １９
1   ゾロ  男  ２１
2   ナミ  女  ２０

## pd.read_   ('Path')

In [125]:
df = pd.read_csv('./dataset/tmdb/tmdb_5000_movies.csv')
df.head(3)

,budget,genres,homepage,id,keywords,original_language,original_title,overview,popularity,production_companies,production_countries,release_date,revenue,runtime,spoken_languages,status,tagline,title,vote_average,vote_count
0,237000000,"[{""id"": 28, ""name"": ""Action""}, {""id"": 12, ""nam...",http://www.avatarmovie.com/,19995,"[{""id"": 1463, ""name"": ""culture clash""}, {""id"":...",en,Avatar,"In the 22nd century, a paraplegic Marine is di...",150.437577,"[{""name"": ""Ingenious Film Partners"", ""id"": 289...","[{""iso_3166_1"": ""US"", ""name"": ""United States o...",2009-12-10,2787965087,162.0,"[{""iso_639_1"": ""en"", ""name"": ""English""}, {""iso...",Released,Enter the World of Pandora.,Avatar,7.2,11800
1,300000000,"[{""id"": 12, ""name"": ""Adventure""}, {""id"": 14, ""...",http://disney.go.com/disneypictures/pirates/,285,"[{""id"": 270, ""name"": ""ocean""}, {""id"": 726, ""na...",en,Pirates of the Caribbean: At World's End,"Captain Barbossa, long believed to be dead, ha...",139.082615,"[{""name"": ""Walt Disney Pictures"", ""id"": 2}, {""...","[{""iso_3166_1"": ""US"", ""name"": ""United States o...",2007-05-19,961000000,169.0,"[{""iso_639_1"": ""en"", ""name"": ""English""}]",Released,"At the end of the world, the adventure begins.",Pirates of the Caribbean: At World's End,6.9,4500
2,245000000,"[{""id"": 28, ""name"": ""Action""}, {""id"": 12, ""nam...",http://www.sonypictures.com/movies/spectre/,206647,"[{""id"": 470, ""name"": ""spy""}, {""id"": 818, ""name...",en,Spectre,A cryptic message from Bond’s past sends him o...,107.376788,"[{""name"": ""Columbia Pictures"", ""id"": 5}, {""nam...","[{""iso_3166_1"": ""GB"", ""name"": ""United Kingdom""...",2015-10-26,880674609,148.0,"[{""iso_639_1"": ""fr"", ""name"": ""Fran\u00e7ais""},...",Released,A Plan No One Escapes,Spectre,6.3,4466

## DataFrame基本操作

### データ確認

In [37]:
len(df)

4803

In [41]:
df.columns

Index(['budget', 'genres', 'homepage', 'id', 'keywords', 'original_language',
       'original_title', 'overview', 'popularity', 'production_companies',
       'production_countries', 'release_date', 'revenue', 'runtime',
       'spoken_languages', 'status', 'tagline', 'title', 'vote_average',
       'vote_count'],
      dtype='object')

In [39]:
df.describe() # type=DataFrame

,budget,id,popularity,revenue,runtime,vote_average,vote_count
count,4.803000e+03,4803.000000,4803.000000,4.803000e+03,4801.000000,4803.000000,4803.000000
mean,2.904504e+07,57165.484281,21.492301,8.226064e+07,106.875859,6.092172,690.217989
std,4.072239e+07,88694.614033,31.816650,1.628571e+08,22.611935,1.194612,1234.585891
min,0.000000e+00,5.000000,0.000000,0.000000e+00,0.000000,0.000000,0.000000
25%,7.900000e+05,9014.500000,4.668070,0.000000e+00,94.000000,5.600000,54.000000
50%,1.500000e+07,14629.000000,12.921594,1.917000e+07,103.000000,6.200000,235.000000
75%,4.000000e+07,58610.500000,28.313505,9.291719e+07,118.000000,6.800000,737.000000
max,3.800000e+08,459488.000000,875.581305,2.787965e+09,338.000000,10.000000,13752.000000

In [46]:
df['revenue'].head() # type=Series

0    2787965087
1     961000000
2     880674609
3    1084939099
4     284139100
Name: revenue, dtype: int64

In [47]:
df[['vote_average', 'vote_count']].head()

   vote_average  vote_count
0           7.2       11800
1           6.9        4500
2           6.3        4466
3           7.6        9106
4           6.1        2124

### .iloc .loc

In [48]:
df.iloc[10] # indexを指定

budget                                                          270000000
genres                  [{"id": 12, "name": "Adventure"}, {"id": 14, "...
homepage                                          http://www.superman.com
id                                                                   1452
keywords                [{"id": 83, "name": "saving the world"}, {"id"...
original_language                                                      en
original_title                                           Superman Returns
overview                Superman returns to discover his 5-year absenc...
popularity                                                        57.9256
production_companies    [{"name": "DC Comics", "id": 429}, {"name": "L...
production_countries    [{"iso_3166_1": "US", "name": "United States o...
release_date                                                   2006-06-28
revenue                                                         391081192
runtime                                                               154
spoken_languages        [{"iso_639_1": "en", "name": "English"}, {"iso...
status                                                           Released
tagline                                                               NaN
title                                                    Superman Returns
vote_average                                                          5.4
vote_count                                                           1400
Name: 10, dtype: object

In [50]:
df.iloc[10:13]['budget']

10    270000000
11    200000000
12    200000000
Name: budget, dtype: int64

In [59]:
df.loc[10]

budget                                                          270000000
genres                  [{"id": 12, "name": "Adventure"}, {"id": 14, "...
homepage                                          http://www.superman.com
id                                                                   1452
keywords                [{"id": 83, "name": "saving the world"}, {"id"...
original_language                                                      en
original_title                                           Superman Returns
overview                Superman returns to discover his 5-year absenc...
popularity                                                        57.9256
production_companies    [{"name": "DC Comics", "id": 429}, {"name": "L...
production_countries    [{"iso_3166_1": "US", "name": "United States o...
release_date                                                   2006-06-28
revenue                                                         391081192
runtime                                                               154
spoken_languages        [{"iso_639_1": "en", "name": "English"}, {"iso...
status                                                           Released
tagline                                                               NaN
title                                                    Superman Returns
vote_average                                                          5.4
vote_count                                                           1400
Name: 10, dtype: object

In [51]:
# カラムが数字、indexが文字列の場合(あんまない)
ndarray = np.arange(25).reshape(5, 5)
index = ['a', 'b', 'c', 'd', 'e']
columes = [0, 1, 2, 3, 4]
df1 = pd.DataFrame(ndarray, index=index, columns=columes)
df1

    0   1   2   3   4
a   0   1   2   3   4
b   5   6   7   8   9
c  10  11  12  13  14
d  15  16  17  18  19
e  20  21  22  23  24

In [56]:
print(df1[0])
print('#'*30)
print(df1.loc['a'])

a     0
b     5
c    10
d    15
e    20
Name: 0, dtype: int64
##############################
0    0
1    1
2    2
3    3
4    4
Name: a, dtype: int64

In [60]:
series = pd.Series([100, 100, 100, 100, 100], index=['a', 'b', 'c', 'd', 'e'])
df1[0] = series
df1

     0   1   2   3   4
a  100   1   2   3   4
b  100   6   7   8   9
c  100  11  12  13  14
d  100  16  17  18  19
e  100  21  22  23  24

In [61]:
df1[5] = series
df1

     0   1   2   3   4    5
a  100   1   2   3   4  100
b  100   6   7   8   9  100
c  100  11  12  13  14  100
d  100  16  17  18  19  100
e  100  21  22  23  24  100

### .drop()

In [62]:
df1.drop('a') # index

     0   1   2   3   4    5
b  100   6   7   8   9  100
c  100  11  12  13  14  100
d  100  16  17  18  19  100
e  100  21  22  23  24  100

In [66]:
df1.drop(0, axis=1, inplace=False) # colume　　　元のdfを変更する場合は,inplace=True

    1   2   3   4    5
a   1   2   3   4  100
b   6   7   8   9  100
c  11  12  13  14  100
d  16  17  18  19  100
e  21  22  23  24  100

In [67]:
df1

     0   1   2   3   4    5
a  100   1   2   3   4  100
b  100   6   7   8   9  100
c  100  11  12  13  14  100
d  100  16  17  18  19  100
e  100  21  22  23  24  100

## フィルター

In [87]:
data = {
    '名前': ['ルフィ', 'ゾロ', 'ナミ', 'ウソップ', 'サンジ', 'チョッパー', 'ロビン', 'フランキー', 'ブルック', 'ジンベエ'],
    '性別': ['男', '男', '女', '男', '男', '男', '女', '男', '男', '男'],
    '年齢': ['１９', '２１', '２０', '１９', '２１', '１７', '３０', '３６', '９０', '４６'],
}
df_pirate = pd.DataFrame(data)
df_pirate

      名前 性別  年齢
0    ルフィ  男  １９
1     ゾロ  男  ２１
2     ナミ  女  ２０
3   ウソップ  男  １９
4    サンジ  男  ２１
5  チョッパー  男  １７
6    ロビン  女  ３０
7  フランキー  男  ３６
8   ブルック  男  ９０
9   ジンベエ  男  ４６

In [94]:
filter_series = pd.Series([True, False, False, True, False, False,True, False, False, True])
df_pirate[filter_series]

     名前 性別  年齢
0   ルフィ  男  １９
3  ウソップ  男  １９
6   ロビン  女  ３０
9  ジンベエ  男  ４６

In [99]:
df_pirate[df_pirate['年齢'].astype(int)>20]

      名前 性別  年齢
1     ゾロ  男  ２１
4    サンジ  男  ２１
6    ロビン  女  ３０
7  フランキー  男  ３６
8   ブルック  男  ９０
9   ジンベエ  男  ４６

In [117]:
df_ja = df[df['original_language']=='ja']
df_ja.head(3)

,budget,genres,homepage,id,keywords,original_language,original_title,overview,popularity,production_companies,production_countries,release_date,revenue,runtime,spoken_languages,status,tagline,title,vote_average,vote_count
97,15000000,"[{""id"": 28, ""name"": ""Action""}, {""id"": 12, ""nam...",NaN,315011,"[{""id"": 1299, ""name"": ""monster""}, {""id"": 7671,...",ja,シン・ゴジラ,From the mind behind Evangelion comes a hit la...,9.476999,"[{""name"": ""Cine Bazar"", ""id"": 5896}, {""name"": ...","[{""iso_3166_1"": ""JP"", ""name"": ""Japan""}]",2016-07-29,77000000,120.0,"[{""iso_639_1"": ""it"", ""name"": ""Italiano""}, {""is...",Released,A god incarnate. A city doomed.,Shin Godzilla,6.5,143
1471,41677699,"[{""id"": 16, ""name"": ""Animation""}, {""id"": 10751...",NaN,12429,"[{""id"": 456, ""name"": ""mother""}, {""id"": 1357, ""...",ja,崖の上のポニョ,"The son of a sailor, 5-year old Sosuke lives a...",39.586760,"[{""name"": ""Studio Ghibli"", ""id"": 10342}, {""nam...","[{""iso_3166_1"": ""JP"", ""name"": ""Japan""}]",2008-07-19,187479518,100.0,"[{""iso_639_1"": ""ja"", ""name"": ""\u65e5\u672c\u8a...",Released,Welcome To A World Where Anything Is Possible.,Ponyo,7.5,926
1709,30000000,"[{""id"": 16, ""name"": ""Animation""}, {""id"": 878, ...",NaN,192577,[],ja,キャプテンハーロック,Space Pirate Captain Harlock and his fearless ...,14.726338,"[{""name"": ""Toei Animation Company"", ""id"": 3116}]","[{""iso_3166_1"": ""JP"", ""name"": ""Japan""}]",2013-09-07,17137302,115.0,"[{""iso_639_1"": ""ja"", ""name"": ""\u65e5\u672c\u8a...",Released,NaN,Space Pirate Captain Harlock,6.5,356

In [105]:
df_ja.describe()

,budget,id,popularity,revenue,runtime,vote_average,vote_count
count,1.600000e+01,16.000000,16.000000,1.600000e+01,16.000000,16.00000,16.000000
mean,1.429361e+07,53894.250000,25.663788,6.602892e+07,122.500000,7.05000,715.750000
std,1.194324e+07,94235.067388,31.637281,9.410171e+07,25.690465,0.95359,1060.489101
min,0.000000e+00,128.000000,0.212443,0.000000e+00,93.000000,5.40000,20.000000
25%,4.625000e+06,341.250000,4.699231,2.286308e+05,110.000000,6.37500,62.000000
50%,1.350000e+07,10817.000000,9.332925,1.323115e+07,119.500000,7.10000,140.000000
75%,2.100000e+07,42567.250000,39.629257,9.759383e+07,127.250000,7.90000,890.000000
max,4.167770e+07,315011.000000,118.968562,2.749251e+08,207.000000,8.30000,3840.000000

In [116]:
budget_mean = df['budget'].mean()
vote_average_mean = df['vote_average'].mean()
df_ja[(df_ja['budget'] < budget_mean) & (df_ja['vote_average'] > vote_average_mean)].head(3)

,budget,genres,homepage,id,keywords,original_language,original_title,overview,popularity,production_companies,production_countries,release_date,revenue,runtime,spoken_languages,status,tagline,title,vote_average,vote_count
97,15000000,"[{""id"": 28, ""name"": ""Action""}, {""id"": 12, ""nam...",NaN,315011,"[{""id"": 1299, ""name"": ""monster""}, {""id"": 7671,...",ja,シン・ゴジラ,From the mind behind Evangelion comes a hit la...,9.476999,"[{""name"": ""Cine Bazar"", ""id"": 5896}, {""name"": ...","[{""iso_3166_1"": ""JP"", ""name"": ""Japan""}]",2016-07-29,77000000,120.0,"[{""iso_639_1"": ""it"", ""name"": ""Italiano""}, {""is...",Released,A god incarnate. A city doomed.,Shin Godzilla,6.5,143
1987,24000000,"[{""id"": 14, ""name"": ""Fantasy""}, {""id"": 16, ""na...",NaN,4935,"[{""id"": 334, ""name"": ""flying""}, {""id"": 616, ""n...",ja,ハウルの動く城,"When Sophie, a shy young woman, is cursed with...",49.549984,"[{""name"": ""Studio Ghibli"", ""id"": 10342}, {""nam...","[{""iso_3166_1"": ""JP"", ""name"": ""Japan""}]",2004-11-19,234710455,119.0,"[{""iso_639_1"": ""ja"", ""name"": ""\u65e5\u672c\u8a...",Released,The two lived there,Howl's Moving Castle,8.2,1991
2247,26500000,"[{""id"": 12, ""name"": ""Adventure""}, {""id"": 14, ""...",NaN,128,"[{""id"": 1721, ""name"": ""fight""}, {""id"": 1994, ""...",ja,もののけ姫,"Ashitaka, a prince of the disappearing Ainu tr...",60.732738,"[{""name"": ""Miramax Films"", ""id"": 14}, {""name"":...","[{""iso_3166_1"": ""JP"", ""name"": ""Japan""}]",1997-07-12,159375308,134.0,"[{""iso_639_1"": ""ja"", ""name"": ""\u65e5\u672c\u8a...",Released,The Fate Of The World Rests On The Courage Of ...,Princess Mononoke,8.2,1983

In [109]:
df['budget'].mean()

29045039.87528628

In [115]:
df[(df['budget'] == 0) | (df['revenue'] == 0)].head(3)

,budget,genres,homepage,id,keywords,original_language,original_title,overview,popularity,production_companies,production_countries,release_date,revenue,runtime,spoken_languages,status,tagline,title,vote_average,vote_count
83,27000000,"[{""id"": 28, ""name"": ""Action""}, {""id"": 12, ""nam...",NaN,79698,[],en,The Lovers,The Lovers is an epic romance time travel adve...,2.418535,"[{""name"": ""Corsan"", ""id"": 7299}, {""name"": ""Bli...","[{""iso_3166_1"": ""AU"", ""name"": ""Australia""}, {""...",2015-02-13,0,109.0,"[{""iso_639_1"": ""en"", ""name"": ""English""}]",Released,Love is longer than life.,The Lovers,4.8,34
135,150000000,"[{""id"": 18, ""name"": ""Drama""}, {""id"": 27, ""name...",http://www.thewolfmanmovie.com/,7978,"[{""id"": 494, ""name"": ""father son relationship""...",en,The Wolfman,"Lawrence Talbot, an American man on a visit to...",21.214571,"[{""name"": ""Universal Pictures"", ""id"": 33}, {""n...","[{""iso_3166_1"": ""US"", ""name"": ""United States o...",2010-02-11,0,102.0,"[{""iso_639_1"": ""en"", ""name"": ""English""}]",Released,When the moon is full the legend comes to life,The Wolfman,5.5,549
265,0,"[{""id"": 35, ""name"": ""Comedy""}, {""id"": 14, ""nam...",NaN,10588,"[{""id"": 977, ""name"": ""cat""}, {""id"": 1155, ""nam...",en,The Cat in the Hat,Conrad and Sally Walden are home alone with th...,18.251129,"[{""name"": ""Imagine Entertainment"", ""id"": 23}, ...","[{""iso_3166_1"": ""US"", ""name"": ""United States o...",2003-11-21,0,82.0,"[{""iso_639_1"": ""en"", ""name"": ""English""}]",Released,Don't mess with the hat.,The Cat in the Hat,4.9,366

### NOT演算

In [124]:
df[~((df['budget'] == 0) | (df['revenue'] == 0))].head(3)

,budget,genres,homepage,id,keywords,original_language,original_title,overview,popularity,production_companies,production_countries,release_date,revenue,runtime,spoken_languages,status,tagline,title,vote_average,vote_count
0,237000000,"[{""id"": 28, ""name"": ""Action""}, {""id"": 12, ""nam...",http://www.avatarmovie.com/,19995,"[{""id"": 1463, ""name"": ""culture clash""}, {""id"":...",en,Avatar,"In the 22nd century, a paraplegic Marine is di...",150.437577,"[{""name"": ""Ingenious Film Partners"", ""id"": 289...","[{""iso_3166_1"": ""US"", ""name"": ""United States o...",2009-12-10,2787965087,162.0,"[{""iso_639_1"": ""en"", ""name"": ""English""}, {""iso...",Released,Enter the World of Pandora.,Avatar,7.2,11800
1,300000000,"[{""id"": 12, ""name"": ""Adventure""}, {""id"": 14, ""...",http://disney.go.com/disneypictures/pirates/,285,"[{""id"": 270, ""name"": ""ocean""}, {""id"": 726, ""na...",en,Pirates of the Caribbean: At World's End,"Captain Barbossa, long believed to be dead, ha...",139.082615,"[{""name"": ""Walt Disney Pictures"", ""id"": 2}, {""...","[{""iso_3166_1"": ""US"", ""name"": ""United States o...",2007-05-19,961000000,169.0,"[{""iso_639_1"": ""en"", ""name"": ""English""}]",Released,"At the end of the world, the adventure begins.",Pirates of the Caribbean: At World's End,6.9,4500
2,245000000,"[{""id"": 28, ""name"": ""Action""}, {""id"": 12, ""nam...",http://www.sonypictures.com/movies/spectre/,206647,"[{""id"": 470, ""name"": ""spy""}, {""id"": 818, ""name...",en,Spectre,A cryptic message from Bond’s past sends him o...,107.376788,"[{""name"": ""Columbia Pictures"", ""id"": 5}, {""nam...","[{""iso_3166_1"": ""GB"", ""name"": ""United Kingdom""...",2015-10-26,880674609,148.0,"[{""iso_639_1"": ""fr"", ""name"": ""Fran\u00e7ais""},...",Released,A Plan No One Escapes,Spectre,6.3,4466

## indexの操作

### .reset_index()

In [135]:
df = df[df['original_language'] == 'ja'] # .reset_index(drop=True) 分かりにくくない範囲で繋げても良い
df = df.reset_index(drop=True).head(3) # drop=True 元のindexを削除(indexをidとしている場合は注意)
df

,budget,genres,homepage,id,keywords,original_language,original_title,overview,popularity,production_companies,production_countries,release_date,revenue,runtime,spoken_languages,status,tagline,title,vote_average,vote_count
0,15000000,"[{""id"": 28, ""name"": ""Action""}, {""id"": 12, ""nam...",NaN,315011,"[{""id"": 1299, ""name"": ""monster""}, {""id"": 7671,...",ja,シン・ゴジラ,From the mind behind Evangelion comes a hit la...,9.476999,"[{""name"": ""Cine Bazar"", ""id"": 5896}, {""name"": ...","[{""iso_3166_1"": ""JP"", ""name"": ""Japan""}]",2016-07-29,77000000,120.0,"[{""iso_639_1"": ""it"", ""name"": ""Italiano""}, {""is...",Released,A god incarnate. A city doomed.,Shin Godzilla,6.5,143
1,41677699,"[{""id"": 16, ""name"": ""Animation""}, {""id"": 10751...",NaN,12429,"[{""id"": 456, ""name"": ""mother""}, {""id"": 1357, ""...",ja,崖の上のポニョ,"The son of a sailor, 5-year old Sosuke lives a...",39.586760,"[{""name"": ""Studio Ghibli"", ""id"": 10342}, {""nam...","[{""iso_3166_1"": ""JP"", ""name"": ""Japan""}]",2008-07-19,187479518,100.0,"[{""iso_639_1"": ""ja"", ""name"": ""\u65e5\u672c\u8a...",Released,Welcome To A World Where Anything Is Possible.,Ponyo,7.5,926
2,30000000,"[{""id"": 16, ""name"": ""Animation""}, {""id"": 878, ...",NaN,192577,[],ja,キャプテンハーロック,Space Pirate Captain Harlock and his fearless ...,14.726338,"[{""name"": ""Toei Animation Company"", ""id"": 3116}]","[{""iso_3166_1"": ""JP"", ""name"": ""Japan""}]",2013-09-07,17137302,115.0,"[{""iso_639_1"": ""ja"", ""name"": ""\u65e5\u672c\u8a...",Released,NaN,Space Pirate Captain Harlock,6.5,356

### .set_index()

In [138]:
df = df.set_index('id').head(3) # indexには意味を持たせず連番とするのが良いので、あまり使わない
df

,budget,genres,homepage,keywords,original_language,original_title,overview,popularity,production_companies,production_countries,release_date,revenue,runtime,spoken_languages,status,tagline,title,vote_average,vote_count
id,,,,,,,,,,,,,,,,,,,
315011,15000000,"[{""id"": 28, ""name"": ""Action""}, {""id"": 12, ""nam...",NaN,"[{""id"": 1299, ""name"": ""monster""}, {""id"": 7671,...",ja,シン・ゴジラ,From the mind behind Evangelion comes a hit la...,9.476999,"[{""name"": ""Cine Bazar"", ""id"": 5896}, {""name"": ...","[{""iso_3166_1"": ""JP"", ""name"": ""Japan""}]",2016-07-29,77000000,120.0,"[{""iso_639_1"": ""it"", ""name"": ""Italiano""}, {""is...",Released,A god incarnate. A city doomed.,Shin Godzilla,6.5,143
12429,41677699,"[{""id"": 16, ""name"": ""Animation""}, {""id"": 10751...",NaN,"[{""id"": 456, ""name"": ""mother""}, {""id"": 1357, ""...",ja,崖の上のポニョ,"The son of a sailor, 5-year old Sosuke lives a...",39.586760,"[{""name"": ""Studio Ghibli"", ""id"": 10342}, {""nam...","[{""iso_3166_1"": ""JP"", ""name"": ""Japan""}]",2008-07-19,187479518,100.0,"[{""iso_639_1"": ""ja"", ""name"": ""\u65e5\u672c\u8a...",Released,Welcome To A World Where Anything Is Possible.,Ponyo,7.5,926
192577,30000000,"[{""id"": 16, ""name"": ""Animation""}, {""id"": 878, ...",NaN,[],ja,キャプテンハーロック,Space Pirate Captain Harlock and his fearless ...,14.726338,"[{""name"": ""Toei Animation Company"", ""id"": 3116}]","[{""iso_3166_1"": ""JP"", ""name"": ""Japan""}]",2013-09-07,17137302,115.0,"[{""iso_639_1"": ""ja"", ""name"": ""\u65e5\u672c\u8a...",Released,NaN,Space Pirate Captain Harlock,6.5,356

In [139]:
df.loc[315011] # .iloc[]:普通のindexの場合、.loc[]:カラムをindexにした場合

budget                                                           15000000
genres                  [{"id": 28, "name": "Action"}, {"id": 12, "nam...
homepage                                                              NaN
keywords                [{"id": 1299, "name": "monster"}, {"id": 7671,...
original_language                                                      ja
original_title                                                     シン・ゴジラ
overview                From the mind behind Evangelion comes a hit la...
popularity                                                          9.477
production_companies    [{"name": "Cine Bazar", "id": 5896}, {"name": ...
production_countries              [{"iso_3166_1": "JP", "name": "Japan"}]
release_date                                                   2016-07-29
revenue                                                          77000000
runtime                                                               120
spoken_languages        [{"iso_639_1": "it", "name": "Italiano"}, {"is...
status                                                           Released
tagline                                   A god incarnate. A city doomed.
title                                                       Shin Godzilla
vote_average                                                          6.5
vote_count                                                            143
Name: 315011, dtype: object

## NaNの取り扱い

In [140]:
df = pd.read_csv('./dataset/tmdb/tmdb_5000_movies.csv')

In [143]:
df.iloc[-1]['homepage'] is np.nan

True

### .dropna() ：nanを取り除く

In [149]:
df.dropna().head(3) # nanを全て取り除く

,budget,genres,homepage,id,keywords,original_language,original_title,overview,popularity,production_companies,production_countries,release_date,revenue,runtime,spoken_languages,status,tagline,title,vote_average,vote_count
0,237000000,"[{""id"": 28, ""name"": ""Action""}, {""id"": 12, ""nam...",http://www.avatarmovie.com/,19995,"[{""id"": 1463, ""name"": ""culture clash""}, {""id"":...",en,Avatar,"In the 22nd century, a paraplegic Marine is di...",150.437577,"[{""name"": ""Ingenious Film Partners"", ""id"": 289...","[{""iso_3166_1"": ""US"", ""name"": ""United States o...",2009-12-10,2787965087,162.0,"[{""iso_639_1"": ""en"", ""name"": ""English""}, {""iso...",Released,Enter the World of Pandora.,Avatar,7.2,11800
1,300000000,"[{""id"": 12, ""name"": ""Adventure""}, {""id"": 14, ""...",http://disney.go.com/disneypictures/pirates/,285,"[{""id"": 270, ""name"": ""ocean""}, {""id"": 726, ""na...",en,Pirates of the Caribbean: At World's End,"Captain Barbossa, long believed to be dead, ha...",139.082615,"[{""name"": ""Walt Disney Pictures"", ""id"": 2}, {""...","[{""iso_3166_1"": ""US"", ""name"": ""United States o...",2007-05-19,961000000,169.0,"[{""iso_639_1"": ""en"", ""name"": ""English""}]",Released,"At the end of the world, the adventure begins.",Pirates of the Caribbean: At World's End,6.9,4500
2,245000000,"[{""id"": 28, ""name"": ""Action""}, {""id"": 12, ""nam...",http://www.sonypictures.com/movies/spectre/,206647,"[{""id"": 470, ""name"": ""spy""}, {""id"": 818, ""name...",en,Spectre,A cryptic message from Bond’s past sends him o...,107.376788,"[{""name"": ""Columbia Pictures"", ""id"": 5}, {""nam...","[{""iso_3166_1"": ""GB"", ""name"": ""United Kingdom""...",2015-10-26,880674609,148.0,"[{""iso_639_1"": ""fr"", ""name"": ""Fran\u00e7ais""},...",Released,A Plan No One Escapes,Spectre,6.3,4466

In [146]:
print(len(df))
print(len(df.dropna()))　# homepageがnan多かったが、データ分析に必要のないカラムであれば取り除く必要はない

4803
1493

In [152]:
df.describe() # runtimeのcountが２件少ないのでデータ欠損している

,budget,id,popularity,revenue,runtime,vote_average,vote_count
count,4.803000e+03,4803.000000,4803.000000,4.803000e+03,4801.000000,4803.000000,4803.000000
mean,2.904504e+07,57165.484281,21.492301,8.226064e+07,106.875859,6.092172,690.217989
std,4.072239e+07,88694.614033,31.816650,1.628571e+08,22.611935,1.194612,1234.585891
min,0.000000e+00,5.000000,0.000000,0.000000e+00,0.000000,0.000000,0.000000
25%,7.900000e+05,9014.500000,4.668070,0.000000e+00,94.000000,5.600000,54.000000
50%,1.500000e+07,14629.000000,12.921594,1.917000e+07,103.000000,6.200000,235.000000
75%,4.000000e+07,58610.500000,28.313505,9.291719e+07,118.000000,6.800000,737.000000
max,3.800000e+08,459488.000000,875.581305,2.787965e+09,338.000000,10.000000,13752.000000

In [155]:
df[np.isnan(df['runtime'])] # isnan()　数値項目のみで使用可能

,budget,genres,homepage,id,keywords,original_language,original_title,overview,popularity,production_companies,production_countries,release_date,revenue,runtime,spoken_languages,status,tagline,title,vote_average,vote_count
2656,15000000,"[{""id"": 18, ""name"": ""Drama""}]",NaN,370980,"[{""id"": 717, ""name"": ""pope""}, {""id"": 5565, ""na...",it,Chiamatemi Francesco - Il Papa della gente,NaN,0.738646,"[{""name"": ""Taodue Film"", ""id"": 45724}]","[{""iso_3166_1"": ""IT"", ""name"": ""Italy""}]",2015-12-03,0,NaN,"[{""iso_639_1"": ""es"", ""name"": ""Espa\u00f1ol""}]",Released,NaN,Chiamatemi Francesco - Il Papa della gente,7.3,12
4140,2,"[{""id"": 99, ""name"": ""Documentary""}]",NaN,459488,"[{""id"": 6027, ""name"": ""music""}, {""id"": 225822,...",en,"To Be Frank, Sinatra at 100",NaN,0.050625,"[{""name"": ""Eyeline Entertainment"", ""id"": 60343}]","[{""iso_3166_1"": ""GB"", ""name"": ""United Kingdom""}]",2015-12-12,0,NaN,[],Released,NaN,"To Be Frank, Sinatra at 100",0.0,0

In [157]:
df = df.dropna(subset=['runtime']) # subset=[list] 指定したカラムのnanをdrop 
len(df)

4801

### .fillna()：欠損値代入

In [158]:
df = pd.read_csv('./dataset/tmdb/tmdb_5000_movies.csv')

In [161]:
df[np.isnan(df['runtime'])]

,budget,genres,homepage,id,keywords,original_language,original_title,overview,popularity,production_companies,production_countries,release_date,revenue,runtime,spoken_languages,status,tagline,title,vote_average,vote_count
2656,15000000,"[{""id"": 18, ""name"": ""Drama""}]",NaN,370980,"[{""id"": 717, ""name"": ""pope""}, {""id"": 5565, ""na...",it,Chiamatemi Francesco - Il Papa della gente,NaN,0.738646,"[{""name"": ""Taodue Film"", ""id"": 45724}]","[{""iso_3166_1"": ""IT"", ""name"": ""Italy""}]",2015-12-03,0,NaN,"[{""iso_639_1"": ""es"", ""name"": ""Espa\u00f1ol""}]",Released,NaN,Chiamatemi Francesco - Il Papa della gente,7.3,12
4140,2,"[{""id"": 99, ""name"": ""Documentary""}]",NaN,459488,"[{""id"": 6027, ""name"": ""music""}, {""id"": 225822,...",en,"To Be Frank, Sinatra at 100",NaN,0.050625,"[{""name"": ""Eyeline Entertainment"", ""id"": 60343}]","[{""iso_3166_1"": ""GB"", ""name"": ""United Kingdom""}]",2015-12-12,0,NaN,[],Released,NaN,"To Be Frank, Sinatra at 100",0.0,0

In [159]:
runtime_mean = df['runtime'].mean()
runtime_mean

106.87585919600083

In [164]:
df['runtime'].fillna(runtime_mean, inplace=True)
df.iloc[[2656, 4140]]

,budget,genres,homepage,id,keywords,original_language,original_title,overview,popularity,production_companies,production_countries,release_date,revenue,runtime,spoken_languages,status,tagline,title,vote_average,vote_count
2656,15000000,"[{""id"": 18, ""name"": ""Drama""}]",NaN,370980,"[{""id"": 717, ""name"": ""pope""}, {""id"": 5565, ""na...",it,Chiamatemi Francesco - Il Papa della gente,NaN,0.738646,"[{""name"": ""Taodue Film"", ""id"": 45724}]","[{""iso_3166_1"": ""IT"", ""name"": ""Italy""}]",2015-12-03,0,106.875859,"[{""iso_639_1"": ""es"", ""name"": ""Espa\u00f1ol""}]",Released,NaN,Chiamatemi Francesco - Il Papa della gente,7.3,12
4140,2,"[{""id"": 99, ""name"": ""Documentary""}]",NaN,459488,"[{""id"": 6027, ""name"": ""music""}, {""id"": 225822,...",en,"To Be Frank, Sinatra at 100",NaN,0.050625,"[{""name"": ""Eyeline Entertainment"", ""id"": 60343}]","[{""iso_3166_1"": ""GB"", ""name"": ""United Kingdom""}]",2015-12-12,0,106.875859,[],Released,NaN,"To Be Frank, Sinatra at 100",0.0,0

In [167]:
len(df[np.isnan(df['runtime'])])

0

### .isna()：DataFrameのNaNチェック（→np.isnan(df[columes])：numpy SeriesでNaNチェック）

In [168]:
df = pd.read_csv('./dataset/tmdb/tmdb_5000_movies.csv')

In [170]:
np.isnan(df['runtime'])

0       False
1       False
2       False
3       False
4       False
        ...
4798    False
4799    False
4800    False
4801    False
4802    False
Name: runtime, Length: 4803, dtype: bool

In [172]:
# pd.isna(df)とも書ける
df.isna().head(3)

,budget,genres,homepage,id,keywords,original_language,original_title,overview,popularity,production_companies,production_countries,release_date,revenue,runtime,spoken_languages,status,tagline,title,vote_average,vote_count
0,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
1,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
2,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False

In [174]:
# df[np.isnan(df['runtime'])]と同じ
df[df['runtime'].isna()]

,budget,genres,homepage,id,keywords,original_language,original_title,overview,popularity,production_companies,production_countries,release_date,revenue,runtime,spoken_languages,status,tagline,title,vote_average,vote_count
2656,15000000,"[{""id"": 18, ""name"": ""Drama""}]",NaN,370980,"[{""id"": 717, ""name"": ""pope""}, {""id"": 5565, ""na...",it,Chiamatemi Francesco - Il Papa della gente,NaN,0.738646,"[{""name"": ""Taodue Film"", ""id"": 45724}]","[{""iso_3166_1"": ""IT"", ""name"": ""Italy""}]",2015-12-03,0,NaN,"[{""iso_639_1"": ""es"", ""name"": ""Espa\u00f1ol""}]",Released,NaN,Chiamatemi Francesco - Il Papa della gente,7.3,12
4140,2,"[{""id"": 99, ""name"": ""Documentary""}]",NaN,459488,"[{""id"": 6027, ""name"": ""music""}, {""id"": 225822,...",en,"To Be Frank, Sinatra at 100",NaN,0.050625,"[{""name"": ""Eyeline Entertainment"", ""id"": 60343}]","[{""iso_3166_1"": ""GB"", ""name"": ""United Kingdom""}]",2015-12-12,0,NaN,[],Released,NaN,"To Be Frank, Sinatra at 100",0.0,0

In [175]:
df['homepage'].isna()

0       False
1       False
2       False
3       False
4       False
        ...
4798     True
4799     True
4800    False
4801    False
4802     True
Name: homepage, Length: 4803, dtype: bool

In [176]:
df['homepage_nan'] = df['homepage'].isna() # Seriesを入れて新しいカラムを作成

In [182]:
df[df['homepage_nan']].head(3) # Trueだけが返ってくる

,budget,genres,homepage,id,keywords,original_language,original_title,overview,popularity,production_companies,...,release_date,revenue,runtime,spoken_languages,status,tagline,title,vote_average,vote_count,homepage_nan
15,225000000,"[{""id"": 12, ""name"": ""Adventure""}, {""id"": 10751...",NaN,2454,"[{""id"": 818, ""name"": ""based on novel""}, {""id"":...",en,The Chronicles of Narnia: Prince Caspian,One year after their incredible adventures in ...,53.978602,"[{""name"": ""Walt Disney"", ""id"": 5888}, {""name"":...",...,2008-05-15,419651413,150.0,"[{""iso_639_1"": ""en"", ""name"": ""English""}]",Released,Hope has a new face.,The Chronicles of Narnia: Prince Caspian,6.3,1630,True
24,207000000,"[{""id"": 12, ""name"": ""Adventure""}, {""id"": 18, ""...",NaN,254,"[{""id"": 774, ""name"": ""film business""}, {""id"": ...",en,King Kong,"In 1933 New York, an overly ambitious movie pr...",61.226010,"[{""name"": ""WingNut Films"", ""id"": 11}, {""name"":...",...,2005-12-14,550000000,187.0,"[{""iso_639_1"": ""en"", ""name"": ""English""}]",Released,The eighth wonder of the world.,King Kong,6.6,2337,True
27,209000000,"[{""id"": 53, ""name"": ""Thriller""}, {""id"": 28, ""n...",NaN,44833,"[{""id"": 1721, ""name"": ""fight""}, {""id"": 4410, ""...",en,Battleship,"When mankind beams a radio signal into space, ...",64.928382,"[{""name"": ""Universal Pictures"", ""id"": 33}, {""n...",...,2012-04-11,303025485,131.0,"[{""iso_639_1"": ""en"", ""name"": ""English""}, {""iso...",Released,The Battle for Earth Begins at Sea,Battleship,5.5,2114,True

## groupby

In [184]:
df = pd.read_csv('./dataset/tmdb/tmdb_5000_movies.csv')

In [189]:
df.groupby('original_language').mean() # 値が0のデータもあるので正しい平均値が得られない →　フィルターする

,budget,id,popularity,revenue,runtime,vote_average,vote_count
original_language,,,,,,,
af,3.000000e+06,868.000000,2.504169,9.879971e+06,94.000000,6.900000,94.000000
ar,0.000000e+00,83505.000000,4.723389,0.000000e+00,92.000000,7.300000,53.500000
cn,1.072641e+07,109470.500000,10.631343,3.374016e+07,104.750000,6.500000,220.916667
cs,0.000000e+00,185196.000000,1.286848,0.000000e+00,104.500000,5.650000,12.000000
da,9.742857e+06,33440.714286,17.663925,2.989889e+07,121.428571,7.128571,450.428571
de,8.616354e+06,63369.518519,10.151382,1.396191e+07,107.777778,6.325926,242.444444
el,0.000000e+00,38810.000000,28.858238,1.101970e+05,94.000000,6.900000,332.000000
en,3.039436e+07,55788.758047,22.177435,8.647885e+07,106.471581,6.065683,719.023751
es,5.847683e+06,73720.937500,13.330804,1.865218e+07,109.093750,6.659375,301.875000
fa,2.450000e+05,38974.000000,5.664415,2.250000e+05,102.250000,7.375000,155.250000
fr,8.480997e+06,62312.171429,10.299542,1.246151e+07,105.114286,6.430000,228.828571
he,6.666667e+05,16428.333333,5.364953,3.708616e+06,108.000000,7.400000,112.666667
hi,1.715789e+06,86905.526316,2.994144,7.447231e+06,138.631579,6.010526,44.000000
hu,0.000000e+00,41508.000000,1.906807,0.000000e+00,140.000000,6.500000,28.000000
id,1.050000e+06,109003.500000,24.586253,2.274881e+06,108.000000,7.400000,632.500000
is,1.000000e+01,217708.000000,1.617943,1.100000e+01,85.000000,6.900000,26.000000
it,2.967859e+06,64481.857143,17.818268,3.029494e+06,114.461538,7.028571,403.928571
ja,1.429361e+07,53894.250000,25.663788,6.602892e+07,122.500000,7.050000,715.750000
ko,1.429091e+07,82569.545455,19.488720,2.535645e+07,123.727273,6.672727,588.818182
ky,0.000000e+00,295914.000000,0.077873,0.000000e+00,135.000000,0.000000,0.000000
nb,3.500000e+06,46146.000000,12.982319,4.159678e+06,103.000000,6.700000,583.000000
nl,7.375000e+06,12169.500000,4.768978,6.680779e+06,118.250000,7.175000,92.750000
no,8.000000e+05,14451.000000,11.205726,1.984662e+06,91.000000,6.100000,311.000000
pl,2.159280e+06,209274.000000,13.265432,1.070000e+07,80.000000,7.100000,260.000000
ps,4.600000e+04,14757.000000,1.447734,0.000000e+00,83.000000,6.300000,32.000000
pt,1.133333e+06,136400.444444,11.309857,4.026498e+06,109.888889,6.388889,321.444444
ro,4.262550e+05,173237.500000,4.798877,5.928915e+05,108.500000,3.650000,78.000000
ru,1.397273e+07,105219.000000,7.567724,9.510074e+06,116.727273,6.354545,95.181818
sl,0.000000e+00,385636.000000,0.061248,0.000000e+00,83.000000,6.000000,1.000000
sv,5.000000e+06,13241.200000,7.347336,0.000000e+00,119.000000,7.060000,87.000000
ta,0.000000e+00,270824.500000,0.368283,0.000000e+00,162.500000,5.850000,4.000000
te,4.000000e+07,256040.000000,16.254032,1.000000e+08,159.000000,7.500000,135.000000
th,4.833333e+06,17554.666667,7.230292,1.203408e+07,130.333333,5.966667,108.333333
tr,1.000000e+07,11818.000000,1.465762,0.000000e+00,122.000000,4.300000,7.000000
vi,1.300000e+06,25784.000000,0.072066,6.390000e+05,135.000000,5.000000,1.000000
xx,1.200000e+07,62204.000000,6.537986,5.526056e+07,100.000000,7.100000,109.000000
zh,2.202560e+07,107819.222222,8.996167,4.173498e+07,116.074074,6.300000,146.592593

In [201]:
df[df['budget'] != 0].groupby('original_language').mean() # budgetが０のデータを除いてgroupby

,budget,id,popularity,revenue,runtime,vote_average,vote_count
original_language,,,,,,,
af,3.000000e+06,868.000000,2.504169,9.879971e+06,94.000000,6.900000,94.000000
cn,1.838814e+07,107731.857143,11.497406,4.497195e+07,108.142857,6.642857,256.428571
da,1.136667e+07,31008.333333,20.070381,3.488204e+07,120.666667,7.016667,514.666667
de,1.454010e+07,69160.437500,14.612254,2.339749e+07,115.000000,6.725000,380.187500
en,3.820497e+07,49290.748047,26.549415,1.077954e+08,109.029026,6.200837,881.667690
es,7.796911e+06,76973.416667,15.157834,2.101711e+07,108.875000,6.645833,346.583333
fa,4.900000e+05,40788.500000,9.560745,4.500000e+05,106.000000,7.750000,290.500000
fr,1.522230e+07,54263.410256,13.577175,2.110555e+07,107.538462,6.743590,315.051282
he,2.000000e+06,8885.000000,14.082510,1.112585e+07,90.000000,7.800000,291.000000
hi,3.622222e+06,119237.555556,3.958068,1.563849e+07,152.444444,6.644444,66.333333
id,1.050000e+06,109003.500000,24.586253,2.274881e+06,108.000000,7.400000,632.500000
is,1.000000e+01,217708.000000,1.617943,1.100000e+01,85.000000,6.900000,26.000000
it,5.193754e+06,77103.625000,28.810470,5.301614e+06,124.571429,7.375000,674.875000
ja,1.524651e+07,56561.266667,27.179317,7.043084e+07,121.733333,7.020000,762.133333
ko,2.245714e+07,27214.285714,24.651664,3.644537e+07,120.000000,6.514286,815.571429
nb,3.500000e+06,46146.000000,12.982319,4.159678e+06,103.000000,6.700000,583.000000
nl,9.833333e+06,14259.333333,6.310628,8.907705e+06,123.333333,7.233333,122.666667
no,8.000000e+05,14451.000000,11.205726,1.984662e+06,91.000000,6.100000,311.000000
pl,2.159280e+06,209274.000000,13.265432,1.070000e+07,80.000000,7.100000,260.000000
ps,4.600000e+04,14757.000000,1.447734,0.000000e+00,83.000000,6.300000,32.000000
pt,3.400000e+06,2870.333333,24.630195,1.207949e+07,119.333333,7.833333,814.666667
ro,8.525100e+05,2009.000000,9.270133,1.185783e+06,113.000000,7.300000,156.000000
ru,1.921250e+07,115048.875000,6.186488,1.257163e+07,111.500000,5.937500,70.875000
sv,2.500000e+07,13491.000000,6.091033,0.000000e+00,139.000000,6.400000,76.000000
te,4.000000e+07,256040.000000,16.254032,1.000000e+08,159.000000,7.500000,135.000000
th,7.250000e+06,12667.500000,10.423904,1.805112e+07,103.000000,6.400000,159.500000
tr,1.000000e+07,11818.000000,1.465762,0.000000e+00,122.000000,4.300000,7.000000
vi,1.300000e+06,25784.000000,0.072066,6.390000e+05,135.000000,5.000000,1.000000
xx,1.200000e+07,62204.000000,6.537986,5.526056e+07,100.000000,7.100000,109.000000
zh,3.303840e+07,94084.666667,11.246990,5.744336e+07,120.000000,6.416667,185.388889

In [194]:
df.groupby('original_language').mean().loc['ja']

budget          1.429361e+07
id              5.389425e+04
popularity      2.566379e+01
revenue         6.602892e+07
runtime         1.225000e+02
vote_average    7.050000e+00
vote_count      7.157500e+02
Name: ja, dtype: float64

In [198]:
df[df['original_language'] == 'ja']['budget'].mean()

14293606.1875

In [203]:
df[df['budget'] != 0].groupby('original_language').mean().loc['ja'] # budgetが０のデータを除いた

budget          1.524651e+07
id              5.656127e+04
popularity      2.717932e+01
revenue         7.043084e+07
runtime         1.217333e+02
vote_average    7.020000e+00
vote_count      7.621333e+02
Name: ja, dtype: float64

In [227]:
df[df['budget'] == 0].groupby('original_language').count()['budget']

original_language
ar      2
cn      5
cs      2
da      1
de     11
el      1
en    921
es      8
fa      2
fr     31
he      2
hi     10
hu      1
it      6
ja      1
ko      4
ky      1
nl      1
pt      6
ro      1
ru      3
sl      1
sv      4
ta      2
th      1
zh      9
Name: budget, dtype: int64

In [235]:
# homepage=nanでフィルターを掛けているのに、countすると全てhomepage＝０なるのは何故？
# df[df['homepage'].isna()].groupby('original_language').count()

In [242]:
df.groupby('original_language').describe()[['revenue', 'budget']].loc[['en', 'ja']]

                  revenue                                              \
                    count          mean           std  min        25%
original_language
en                 4505.0  8.647885e+07  1.669566e+08  0.0       0.00
ja                   16.0  6.602892e+07  9.410171e+07  0.0  228630.75

                                                         budget                \
                          50%         75%           max   count          mean
original_language
en                 22034832.0  98185582.0  2.787965e+09  4505.0  3.039436e+07
ja                 13231147.0  97593827.0  2.749251e+08    16.0  1.429361e+07

                                                                         \
                            std  min        25%         50%         75%
original_language
en                 4.150614e+07  0.0  1000000.0  15000000.0  40000000.0
ja                 1.194324e+07  0.0  4625000.0  13500000.0  21000000.0


                           max
original_language
en                 380000000.0
ja                  41677699.0

In [244]:
df.groupby('original_language')['revenue'].max().loc[['en', 'ja']] # .max().min()はカラムを指定

original_language
en    2787965087
ja     274925095
Name: revenue, dtype: int64

### .idxmax()

In [249]:
df.iloc[df.groupby('original_language')['revenue'].idxmax()].head(3) # .iloc[idx] idx:idxmax()でmaxのindex取得

,budget,genres,homepage,id,keywords,original_language,original_title,overview,popularity,production_companies,production_countries,release_date,revenue,runtime,spoken_languages,status,tagline,title,vote_average,vote_count
3936,3000000,"[{""id"": 80, ""name"": ""Crime""}, {""id"": 18, ""name...",http://www.tsotsimovie.com/,868,"[{""id"": 100, ""name"": ""slum""}, {""id"": 1009, ""na...",af,Tsotsi,The South African multi-award winning film abo...,2.504169,"[{""name"": ""Movieworld Productions"", ""id"": 563}...","[{""iso_3166_1"": ""ZA"", ""name"": ""South Africa""}]",2005-08-18,9879971,94.0,"[{""iso_639_1"": ""af"", ""name"": ""Afrikaans""}, {""i...",Released,In this world... Redemption comes just once.,Tsotsi,6.9,94
4164,0,"[{""id"": 99, ""name"": ""Documentary""}, {""id"": 18,...",http://www.thesquarefilm.com/,159037,"[{""id"": 187056, ""name"": ""woman director""}]",ar,The Square,"The Square, a new film by Jehane Noujaim (Cont...",4.892203,"[{""name"": ""Roast Beef Productions"", ""id"": 7266...","[{""iso_3166_1"": ""GB"", ""name"": ""United Kingdom""...",2013-06-07,0,88.0,"[{""iso_639_1"": ""ar"", ""name"": ""\u0627\u0644\u06...",Released,What does it mean to risk your life for your i...,The Square,7.8,55
1357,36000000,"[{""id"": 28, ""name"": ""Action""}, {""id"": 18, ""nam...",NaN,365222,"[{""id"": 5565, ""name"": ""biography""}]",cn,葉問3,When a band of brutal gangsters led by a crook...,19.167377,"[{""name"": ""Mandarin Films Distribution Co."", ""...","[{""iso_3166_1"": ""HK"", ""name"": ""Hong Kong""}]",2015-12-19,156844753,105.0,"[{""iso_639_1"": ""cn"", ""name"": ""\u5e7f\u5dde\u8b...",Released,NaN,Ip Man 3,6.5,379

## 表結合

In [255]:
data_pirate = {
    '名前': ['ルフィ', 'ゾロ', 'ナミ', 'ウソップ', 'サンジ', 'チョッパー', 'ロビン', 'フランキー', 'ブルック', 'ジンベエ'],
    '性別': ['男', '男', '女', '男', '男', '男', '女', '男', '男', '男'],
    '年齢': ['１９', '２１', '２０', '１９', '２１', '１７', '３０', '３６', '９０', '４６'],
}
data_navy = {
    '名前': ['ガープ', 'クザン', 'コビー'],
    '性別': ['男', '男', '男'],
    '年齢': ['７８', '４９', '１８'],
    'マリンコード': [999, 1111, 2000],
}
df_pirate = pd.DataFrame(data_pirate)
df_navy = pd.DataFrame(data_navy)
df_pirate

      名前 性別  年齢
0    ルフィ  男  １９
1     ゾロ  男  ２１
2     ナミ  女  ２０
3   ウソップ  男  １９
4    サンジ  男  ２１
5  チョッパー  男  １７
6    ロビン  女  ３０
7  フランキー  男  ３６
8   ブルック  男  ９０
9   ジンベエ  男  ４６

In [256]:
df_navy

    名前 性別  年齢  マリンコード
0  ガープ  男  ７８     999
1  クザン  男  ４９    1111
2  コビー  男  １８    2000

### pd.concat()

In [259]:
pd.concat([df_pirate, df_navy], axis=0) # axis=1 横

      名前 性別  年齢  マリンコード
0    ルフィ  男  １９     NaN
1     ゾロ  男  ２１     NaN
2     ナミ  女  ２０     NaN
3   ウソップ  男  １９     NaN
4    サンジ  男  ２１     NaN
5  チョッパー  男  １７     NaN
6    ロビン  女  ３０     NaN
7  フランキー  男  ３６     NaN
8   ブルック  男  ９０     NaN
9   ジンベエ  男  ４６     NaN
0    ガープ  男  ７８   999.0
1    クザン  男  ４９  1111.0
2    コビー  男  １８  2000.0

### .merge() ：カラムをkeyにして結合

In [269]:
# onに指定したカラム以外の被っているカラムはsuffixesがつく
df_pirate.merge(df_navy, how='outer', on='名前', suffixes=('_pirate', '_navy'))

       名前 性別_pirate 年齢_pirate 性別_navy 年齢_navy  マリンコード
0     ルフィ         男        １９     NaN     NaN     NaN
1      ゾロ         男        ２１     NaN     NaN     NaN
2      ナミ         女        ２０     NaN     NaN     NaN
3    ウソップ         男        １９     NaN     NaN     NaN
4     サンジ         男        ２１     NaN     NaN     NaN
5   チョッパー         男        １７     NaN     NaN     NaN
6     ロビン         女        ３０     NaN     NaN     NaN
7   フランキー         男        ３６     NaN     NaN     NaN
8    ブルック         男        ９０     NaN     NaN     NaN
9    ジンベエ         男        ４６     NaN     NaN     NaN
10    ガープ       NaN       NaN       男      ７８   999.0
11    クザン       NaN       NaN       男      ４９  1111.0
12    コビー       NaN       NaN       男      １８  2000.0

In [270]:
# カメさん言わくindexでの結合はあまり良くない
df_pirate.merge(df_navy, how='outer', left_index=True, right_index=True, suffixes=('_pirate', '_navy'))

  名前_pirate 性別_pirate 年齢_pirate 名前_navy 性別_navy 年齢_navy  マリンコード
0       ルフィ         男        １９     ガープ       男      ７８   999.0
1        ゾロ         男        ２１     クザン       男      ４９  1111.0
2        ナミ         女        ２０     コビー       男      １８  2000.0
3      ウソップ         男        １９     NaN     NaN     NaN     NaN
4       サンジ         男        ２１     NaN     NaN     NaN     NaN
5     チョッパー         男        １７     NaN     NaN     NaN     NaN
6       ロビン         女        ３０     NaN     NaN     NaN     NaN
7     フランキー         男        ３６     NaN     NaN     NaN     NaN
8      ブルック         男        ９０     NaN     NaN     NaN     NaN
9      ジンベエ         男        ４６     NaN     NaN     NaN     NaN

In [271]:
df_movies = pd.read_csv('./dataset/tmdb/tmdb_5000_movies.csv')
df_credits = pd.read_csv('./dataset/tmdb/tmdb_5000_credits.csv')

In [272]:
print(len(df_movies))
print(len(df_credits))

4803
4803

In [274]:
print(df_movies.columns)
print(df_credits.columns)

Index(['budget', 'genres', 'homepage', 'id', 'keywords', 'original_language',
       'original_title', 'overview', 'popularity', 'production_companies',
       'production_countries', 'release_date', 'revenue', 'runtime',
       'spoken_languages', 'status', 'tagline', 'title', 'vote_average',
       'vote_count'],
      dtype='object')
Index(['movie_id', 'title', 'cast', 'crew'], dtype='object')

In [276]:
df = df_movies.merge(df_credits, how='inner', 
                     left_on='id', right_on='movie_id', 
                     suffixes=('_movies', '_credits'))
df.head(3)

,budget,genres,homepage,id,keywords,original_language,original_title,overview,popularity,production_companies,...,spoken_languages,status,tagline,title_movies,vote_average,vote_count,movie_id,title_credits,cast,crew
0,237000000,"[{""id"": 28, ""name"": ""Action""}, {""id"": 12, ""nam...",http://www.avatarmovie.com/,19995,"[{""id"": 1463, ""name"": ""culture clash""}, {""id"":...",en,Avatar,"In the 22nd century, a paraplegic Marine is di...",150.437577,"[{""name"": ""Ingenious Film Partners"", ""id"": 289...",...,"[{""iso_639_1"": ""en"", ""name"": ""English""}, {""iso...",Released,Enter the World of Pandora.,Avatar,7.2,11800,19995,Avatar,"[{""cast_id"": 242, ""character"": ""Jake Sully"", ""...","[{""credit_id"": ""52fe48009251416c750aca23"", ""de..."
1,300000000,"[{""id"": 12, ""name"": ""Adventure""}, {""id"": 14, ""...",http://disney.go.com/disneypictures/pirates/,285,"[{""id"": 270, ""name"": ""ocean""}, {""id"": 726, ""na...",en,Pirates of the Caribbean: At World's End,"Captain Barbossa, long believed to be dead, ha...",139.082615,"[{""name"": ""Walt Disney Pictures"", ""id"": 2}, {""...",...,"[{""iso_639_1"": ""en"", ""name"": ""English""}]",Released,"At the end of the world, the adventure begins.",Pirates of the Caribbean: At World's End,6.9,4500,285,Pirates of the Caribbean: At World's End,"[{""cast_id"": 4, ""character"": ""Captain Jack Spa...","[{""credit_id"": ""52fe4232c3a36847f800b579"", ""de..."
2,245000000,"[{""id"": 28, ""name"": ""Action""}, {""id"": 12, ""nam...",http://www.sonypictures.com/movies/spectre/,206647,"[{""id"": 470, ""name"": ""spy""}, {""id"": 818, ""name...",en,Spectre,A cryptic message from Bond’s past sends him o...,107.376788,"[{""name"": ""Columbia Pictures"", ""id"": 5}, {""nam...",...,"[{""iso_639_1"": ""fr"", ""name"": ""Fran\u00e7ais""},...",Released,A Plan No One Escapes,Spectre,6.3,4466,206647,Spectre,"[{""cast_id"": 1, ""character"": ""James Bond"", ""cr...","[{""credit_id"": ""54805967c3a36829b5002c41"", ""de..."

In [277]:
len(df)

4803

## .join()：複数のDataFrameをまとめて結合(かめさん的にはmergeを複数回やった方が良い)

In [287]:
data_pirate = {
    'name': ['ルフィ', 'ゾロ', 'ナミ', 'ウソップ', 'サンジ', 'チョッパー', 'ロビン', 'フランキー', 'ブルック', 'ジンベエ'],
    'sex': ['男', '男', '女', '男', '男', '男', '女', '男', '男', '男'],
    'age': ['１９', '２１', '２０', '１９', '２１', '１７', '３０', '３６', '９０', '４６'],
}
data_navy = {
    'name': ['ガープ', 'クザン', 'コビー'],
    'sex': ['男', '男', '男'],
    'age': ['７８', '４９', '１８'],
    'code': [999, 1111, 2000],
}
data_rev_army = {
    'name': ['ドラゴン', 'サボ', 'コアラ'],
    'sex': ['男', '男', '女'],
    'age': ['５５', '２２', '２３'],
}
df_pirate = pd.DataFrame(data_pirate)
df_navy = pd.DataFrame(data_navy)
df_rev_army = pd.DataFrame(data_rev_army)
df_pirate

    name sex age
0    ルフィ   男  １９
1     ゾロ   男  ２１
2     ナミ   女  ２０
3   ウソップ   男  １９
4    サンジ   男  ２１
5  チョッパー   男  １７
6    ロビン   女  ３０
7  フランキー   男  ３６
8   ブルック   男  ９０
9   ジンベエ   男  ４６

In [288]:
df_navy

  name sex age  code
0  ガープ   男  ７８   999
1  クザン   男  ４９  1111
2  コビー   男  １８  2000

In [289]:
df_rev_army

   name sex age
0  ドラゴン   男  ５５
1    サボ   男  ２２
2   コアラ   女  ２３

In [301]:
data1 = {
    'No.1': [111, 222, 333],
    'key1': ['a', 'b', 'c'],
    'key2': ['A', 'B', 'C'],
}
data2 = {
    'No.2': [444, 555, 666],
    'key3': ['l', 'm', 'n'],
    'key4': ['L', 'M', 'C'],
}
data3 = {
    'No.3': [777, 888, 999],
    'key5': ['x', 'y', 'z'],
    'key6': ['X', 'Y', 'Z'],
}

df1 = pd.DataFrame(data1)
df2 = pd.DataFrame(data2)
df3 = pd.DataFrame(data3)
df1.join([df2, df3])
# df_pirate.join([df_navy, df_rev_army], how='outer') ERROR:Joining multiple DataFrames only supported for joining on index

   No.1 key1 key2  No.2 key3 key4  No.3 key5 key6
0   111    a    A   444    l    L   777    x    X
1   222    b    B   555    m    M   888    y    Y
2   333    c    C   666    n    C   999    z    Z

## DataFrameとSeriesの便利関数

### .unique()と.numique()

In [305]:
df['original_language'].unique() # Seriesに対して

array(['en', 'ja', 'fr', 'zh', 'es', 'de', 'hi', 'ru', 'ko', 'te', 'cn',
       'it', 'nl', 'ta', 'sv', 'th', 'da', 'xx', 'hu', 'cs', 'pt', 'is',
       'tr', 'nb', 'af', 'pl', 'he', 'ar', 'vi', 'ky', 'id', 'ro', 'fa',
       'no', 'sl', 'ps', 'el'], dtype=object)

In [306]:
df['original_language'].nunique()

37

In [307]:
len(df)

4803

In [308]:
df['id'].nunique() # idは本当にuniqueなのか

4803

### .value_counts()：それぞれの値のレコード数を取得

In [310]:
df['original_language'].value_counts() # Seriesに対して

en    4505
fr      70
es      32
de      27
zh      27
hi      19
ja      16
it      14
cn      12
ru      11
ko      11
pt       9
da       7
sv       5
nl       4
fa       4
he       3
th       3
ta       2
id       2
ro       2
cs       2
ar       2
ps       1
te       1
tr       1
pl       1
af       1
xx       1
hu       1
ky       1
nb       1
sl       1
el       1
is       1
no       1
vi       1
Name: original_language, dtype: int64

### .sort_vlues()：レコードを並び替え

In [313]:
# ascending:昇順降順
df.sort_values(by='budget', ascending=False).head(3) # DataFrameに対して

,budget,genres,homepage,id,keywords,original_language,original_title,overview,popularity,production_companies,...,spoken_languages,status,tagline,title_movies,vote_average,vote_count,movie_id,title_credits,cast,crew
17,380000000,"[{""id"": 12, ""name"": ""Adventure""}, {""id"": 28, ""...",http://disney.go.com/pirates/index-on-stranger...,1865,"[{""id"": 658, ""name"": ""sea""}, {""id"": 1316, ""nam...",en,Pirates of the Caribbean: On Stranger Tides,Captain Jack Sparrow crosses paths with a woma...,135.413856,"[{""name"": ""Walt Disney Pictures"", ""id"": 2}, {""...",...,"[{""iso_639_1"": ""en"", ""name"": ""English""}, {""iso...",Released,Live Forever Or Die Trying.,Pirates of the Caribbean: On Stranger Tides,6.4,4948,1865,Pirates of the Caribbean: On Stranger Tides,"[{""cast_id"": 15, ""character"": ""Captain Jack Sp...","[{""credit_id"": ""566b4f54c3a3683f56005151"", ""de..."
1,300000000,"[{""id"": 12, ""name"": ""Adventure""}, {""id"": 14, ""...",http://disney.go.com/disneypictures/pirates/,285,"[{""id"": 270, ""name"": ""ocean""}, {""id"": 726, ""na...",en,Pirates of the Caribbean: At World's End,"Captain Barbossa, long believed to be dead, ha...",139.082615,"[{""name"": ""Walt Disney Pictures"", ""id"": 2}, {""...",...,"[{""iso_639_1"": ""en"", ""name"": ""English""}]",Released,"At the end of the world, the adventure begins.",Pirates of the Caribbean: At World's End,6.9,4500,285,Pirates of the Caribbean: At World's End,"[{""cast_id"": 4, ""character"": ""Captain Jack Spa...","[{""credit_id"": ""52fe4232c3a36847f800b579"", ""de..."
7,280000000,"[{""id"": 28, ""name"": ""Action""}, {""id"": 12, ""nam...",http://marvel.com/movies/movie/193/avengers_ag...,99861,"[{""id"": 8828, ""name"": ""marvel comic""}, {""id"": ...",en,Avengers: Age of Ultron,When Tony Stark tries to jumpstart a dormant p...,134.279229,"[{""name"": ""Marvel Studios"", ""id"": 420}, {""name...",...,"[{""iso_639_1"": ""en"", ""name"": ""English""}]",Released,A New Age Has Come.,Avengers: Age of Ultron,7.3,6767,99861,Avengers: Age of Ultron,"[{""cast_id"": 76, ""character"": ""Tony Stark / Ir...","[{""credit_id"": ""55d5f7d4c3a3683e7e0016eb"", ""de..."

## DataFrameのIteration

### .apply()：関数を各行に適用する

In [334]:
df['budget'] = df['budget'].apply(lambda x: np.nan if x == 0 else x)
df['revenue'] = df['revenue'].apply(lambda x: np.nan if x == 0 else x)

In [335]:
df[(df['budget'] == 0) | (df['revenue'] == 0)]

Empty DataFrame
Columns: [budget, genres, homepage, id, keywords, original_language, original_title, overview, popularity, production_companies, production_countries, release_date, revenue, runtime, spoken_languages, status, tagline, title_movies, vote_average, vote_count, movie_id, title_credits, cast, crew]
Index: []

[0 rows x 24 columns]

In [348]:
df = df.dropna(subset=['budget', 'revenue'])
len(df)

3229

In [349]:
# revenue(収益) - budget(予算) = profit(利益)
df['revenue'] - df['budget']

0       2.550965e+09
1       6.610000e+08
2       6.356746e+08
3       8.349391e+08
4       2.413910e+07
            ...
4773    3.124130e+06
4788    5.988000e+06
4792    7.900000e+04
4796    4.177600e+05
4798    1.820920e+06
Length: 3229, dtype: float64

In [350]:
# axis:
#  0 or 'index': apply function to each column.
#  1 or 'columns': apply function to each row.
df.apply(lambda row: row['revenue'] - row['budget'], axis=1) # rowを指定するときはaxis=1
# カラム１つの場合は、df[columes].apply()でも良い

0       2.550965e+09
1       6.610000e+08
2       6.356746e+08
3       8.349391e+08
4       2.413910e+07
            ...
4773    3.124130e+06
4788    5.988000e+06
4792    7.900000e+04
4796    4.177600e+05
4798    1.820920e+06
Length: 3229, dtype: float64

In [351]:
df['profit'] = df['revenue'] - df['budget']

/opt/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

In [355]:
df['profit'].idxmax()

0

In [356]:
df.iloc[0]

budget                                                           2.37e+08
genres                  [{"id": 28, "name": "Action"}, {"id": 12, "nam...
homepage                                      http://www.avatarmovie.com/
id                                                                  19995
keywords                [{"id": 1463, "name": "culture clash"}, {"id":...
original_language                                                      en
original_title                                                     Avatar
overview                In the 22nd century, a paraplegic Marine is di...
popularity                                                        150.438
production_companies    [{"name": "Ingenious Film Partners", "id": 289...
production_countries    [{"iso_3166_1": "US", "name": "United States o...
release_date                                                   2009-12-10
revenue                                                       2.78797e+09
runtime                                                               162
spoken_languages        [{"iso_639_1": "en", "name": "English"}, {"iso...
status                                                           Released
tagline                                       Enter the World of Pandora.
title_movies                                                       Avatar
vote_average                                                          7.2
vote_count                                                          11800
movie_id                                                            19995
title_credits                                                      Avatar
cast                    [{"cast_id": 242, "character": "Jake Sully", "...
crew                    [{"credit_id": "52fe48009251416c750aca23", "de...
profit                                                        2.55097e+09
Name: 0, dtype: object

In [357]:
df[df['profit'] == df['profit'].max()]

,budget,genres,homepage,id,keywords,original_language,original_title,overview,popularity,production_companies,...,status,tagline,title_movies,vote_average,vote_count,movie_id,title_credits,cast,crew,profit
0,237000000.0,"[{""id"": 28, ""name"": ""Action""}, {""id"": 12, ""nam...",http://www.avatarmovie.com/,19995,"[{""id"": 1463, ""name"": ""culture clash""}, {""id"":...",en,Avatar,"In the 22nd century, a paraplegic Marine is di...",150.437577,"[{""name"": ""Ingenious Film Partners"", ""id"": 289...",...,Released,Enter the World of Pandora.,Avatar,7.2,11800,19995,Avatar,"[{""cast_id"": 242, ""character"": ""Jake Sully"", ""...","[{""credit_id"": ""52fe48009251416c750aca23"", ""de...",2.550965e+09

### .iterrows()：DataFrameのrowをiterationさせられるiterableを返す

In [358]:
df.iterrows()

In [359]:
next(df.iterrows())

(0,
 budget                                                           2.37e+08
 genres                  [{"id": 28, "name": "Action"}, {"id": 12, "nam...
 homepage                                      http://www.avatarmovie.com/
 id                                                                  19995
 keywords                [{"id": 1463, "name": "culture clash"}, {"id":...
 original_language                                                      en
 original_title                                                     Avatar
 overview                In the 22nd century, a paraplegic Marine is di...
 popularity                                                        150.438
 production_companies    [{"name": "Ingenious Film Partners", "id": 289...
 production_countries    [{"iso_3166_1": "US", "name": "United States o...
 release_date                                                   2009-12-10
 revenue                                                       2.78797e+09
 runtime                                                               162
 spoken_languages        [{"iso_639_1": "en", "name": "English"}, {"iso...
 status                                                           Released
 tagline                                       Enter the World of Pandora.
 title_movies                                                       Avatar
 vote_average                                                          7.2
 vote_count                                                          11800
 movie_id                                                            19995
 title_credits                                                      Avatar
 cast                    [{"cast_id": 242, "character": "Jake Sully", "...
 crew                    [{"credit_id": "52fe48009251416c750aca23", "de...
 profit                                                        2.55097e+09
 Name: 0, dtype: object)

In [363]:
print(type(df.iterrows()))
print(type(next(df.iterrows())))

<class 'generator'>
<class 'tuple'>

In [366]:
a, b = next(df.iterrows())
b

budget                                                           2.37e+08
genres                  [{"id": 28, "name": "Action"}, {"id": 12, "nam...
homepage                                      http://www.avatarmovie.com/
id                                                                  19995
keywords                [{"id": 1463, "name": "culture clash"}, {"id":...
original_language                                                      en
original_title                                                     Avatar
overview                In the 22nd century, a paraplegic Marine is di...
popularity                                                        150.438
production_companies    [{"name": "Ingenious Film Partners", "id": 289...
production_countries    [{"iso_3166_1": "US", "name": "United States o...
release_date                                                   2009-12-10
revenue                                                       2.78797e+09
runtime                                                               162
spoken_languages        [{"iso_639_1": "en", "name": "English"}, {"iso...
status                                                           Released
tagline                                       Enter the World of Pandora.
title_movies                                                       Avatar
vote_average                                                          7.2
vote_count                                                          11800
movie_id                                                            19995
title_credits                                                      Avatar
cast                    [{"cast_id": 242, "character": "Jake Sully", "...
crew                    [{"credit_id": "52fe48009251416c750aca23", "de...
profit                                                        2.55097e+09
Name: 0, dtype: object

In [367]:
df.describe()

,budget,id,popularity,revenue,runtime,vote_average,vote_count,movie_id,profit
count,3.229000e+03,3229.000000,3229.000000,3.229000e+03,3229.000000,3229.000000,3229.000000,3229.000000,3.229000e+03
mean,4.065444e+07,44780.705791,29.033689,1.212430e+08,110.724373,6.309353,977.287395,44780.705791,8.058851e+07
std,4.439674e+07,74609.434723,36.165730,1.863029e+08,20.965694,0.873891,1414.309577,74609.434723,1.581479e+08
min,1.000000e+00,5.000000,0.019984,5.000000e+00,41.000000,0.000000,0.000000,5.000000,-1.657101e+08
25%,1.050000e+07,4958.000000,10.446722,1.700000e+07,96.000000,5.800000,178.000000,4958.000000,2.113940e+05
50%,2.500000e+07,11451.000000,20.410354,5.518472e+07,107.000000,6.300000,471.000000,11451.000000,2.616557e+07
75%,5.500000e+07,45272.000000,37.335721,1.462920e+08,121.000000,6.900000,1148.000000,45272.000000,9.748982e+07
max,3.800000e+08,417859.000000,875.581305,2.787965e+09,338.000000,8.500000,13752.000000,417859.000000,2.550965e+09

In [370]:
df.head(3)

,budget,genres,homepage,id,keywords,original_language,original_title,overview,popularity,production_companies,...,status,tagline,title_movies,vote_average,vote_count,movie_id,title_credits,cast,crew,profit
0,237000000.0,"[{""id"": 28, ""name"": ""Action""}, {""id"": 12, ""nam...",http://www.avatarmovie.com/,19995,"[{""id"": 1463, ""name"": ""culture clash""}, {""id"":...",en,Avatar,"In the 22nd century, a paraplegic Marine is di...",150.437577,"[{""name"": ""Ingenious Film Partners"", ""id"": 289...",...,Released,Enter the World of Pandora.,Avatar,7.2,11800,19995,Avatar,"[{""cast_id"": 242, ""character"": ""Jake Sully"", ""...","[{""credit_id"": ""52fe48009251416c750aca23"", ""de...",2.550965e+09
1,300000000.0,"[{""id"": 12, ""name"": ""Adventure""}, {""id"": 14, ""...",http://disney.go.com/disneypictures/pirates/,285,"[{""id"": 270, ""name"": ""ocean""}, {""id"": 726, ""na...",en,Pirates of the Caribbean: At World's End,"Captain Barbossa, long believed to be dead, ha...",139.082615,"[{""name"": ""Walt Disney Pictures"", ""id"": 2}, {""...",...,Released,"At the end of the world, the adventure begins.",Pirates of the Caribbean: At World's End,6.9,4500,285,Pirates of the Caribbean: At World's End,"[{""cast_id"": 4, ""character"": ""Captain Jack Spa...","[{""credit_id"": ""52fe4232c3a36847f800b579"", ""de...",6.610000e+08
2,245000000.0,"[{""id"": 28, ""name"": ""Action""}, {""id"": 12, ""nam...",http://www.sonypictures.com/movies/spectre/,206647,"[{""id"": 470, ""name"": ""spy""}, {""id"": 818, ""name...",en,Spectre,A cryptic message from Bond’s past sends him o...,107.376788,"[{""name"": ""Columbia Pictures"", ""id"": 5}, {""nam...",...,Released,A Plan No One Escapes,Spectre,6.3,4466,206647,Spectre,"[{""cast_id"": 1, ""character"": ""James Bond"", ""cr...","[{""credit_id"": ""54805967c3a36829b5002c41"", ""de...",6.356746e+08

In [381]:
vote_average_mean = df['vote_average'].mean()
for idx, row in df.iterrows():
    if row['vote_average'] > 8:
        print(idx, row['title_movies'])

65 The Dark Knight
95 Interstellar
96 Inception
329 The Lord of the Rings: The Return of the King
662 Fight Club
690 The Green Mile
809 Forrest Gump
1553 Se7en
1818 Schindler's List
1847 GoodFellas
1881 The Shawshank Redemption
1987 Howl's Moving Castle
1990 The Empire Strikes Back
2091 The Silence of the Lambs
2170 Psycho
2247 Princess Mononoke
2284 The Shining
2294 Spirited Away
2453 Dead Poets Society
2731 The Godfather: Part II
2760 Room
2912 Star Wars
2947 The Visual Bible: The Gospel of John
2970 There Goes My Baby
3057 American History X
3232 Pulp Fiction
3337 The Godfather
3454 The Usual Suspects
3573 Memento
3622 Once Upon a Time in the West
3719 One Flew Over the Cuckoo's Nest
3865 Whiplash
3866 City of God
3906 The Apartment
4238 Modern Times
4302 The Good, the Bad and the Ugly
4535 Seven Samurai
4602 12 Angry Men

## ピポッドテーブルの作り方

In [405]:
data_pirate = {
    'name': ['ルフィ', 'ゾロ', 'ナミ', 'ウソップ', 'サンジ', 'チョッパー', 'ロビン', 'フランキー', 'ブルック', 'ジンベエ'],
    'sex': ['男', '男', '女', '男', '男', '男', '女', '男', '男', '男'],
    'age': ['１９', '２１', '２０', '１９', '２１', '１７', '３０', '３６', '９０', '４６'],
    'bounty': [3e9, 1.111e9, 3.66e8, 5e8, 1.032e9, 1e3, 9.3e8, 3.94e8, 3.83e8, 1.1e9],
}
df_pirate = pd.DataFrame(data_pirate)
df_pirate['age'] = df_pirate['age'].astype(int)
df_pirate

    name sex  age        bounty
0    ルフィ   男   19  3.000000e+09
1     ゾロ   男   21  1.111000e+09
2     ナミ   女   20  3.660000e+08
3   ウソップ   男   19  5.000000e+08
4    サンジ   男   21  1.032000e+09
5  チョッパー   男   17  1.000000e+03
6    ロビン   女   30  9.300000e+08
7  フランキー   男   36  3.940000e+08
8   ブルック   男   90  3.830000e+08
9   ジンベエ   男   46  1.100000e+09

In [406]:
# values＝集計したい値、index,columes＝集計軸　
df_pirate.pivot_table(values='bounty', index=['name', 'age'], columns=['sex'])

sex                  女             男
name  age
ウソップ  19           NaN  5.000000e+08
サンジ   21           NaN  1.032000e+09
ジンベエ  46           NaN  1.100000e+09
ゾロ    21           NaN  1.111000e+09
チョッパー 17           NaN  1.000000e+03
ナミ    20   366000000.0           NaN
フランキー 36           NaN  3.940000e+08
ブルック  90           NaN  3.830000e+08
ルフィ   19           NaN  3.000000e+09
ロビン   30   930000000.0           NaN

In [409]:
pivod_df = df_pirate.pivot_table(values='bounty', index=['sex', 'age'], columns=['name'])
pivod_df

name            ウソップ           サンジ          ジンベエ            ゾロ   チョッパー  \
sex age
女   20           NaN           NaN           NaN           NaN     NaN
    30           NaN           NaN           NaN           NaN     NaN
男   17           NaN           NaN           NaN           NaN  1000.0
    19   500000000.0           NaN           NaN           NaN     NaN
    21           NaN  1.032000e+09           NaN  1.111000e+09     NaN
    36           NaN           NaN           NaN           NaN     NaN
    46           NaN           NaN  1.100000e+09           NaN     NaN
    90           NaN           NaN           NaN           NaN     NaN

name              ナミ        フランキー         ブルック           ルフィ          ロビン
sex age
女   20   366000000.0          NaN          NaN           NaN          NaN
    30           NaN          NaN          NaN           NaN  930000000.0
男   17           NaN          NaN          NaN           NaN          NaN
    19           NaN          NaN          NaN  3.000000e+09          NaN
    21           NaN          NaN          NaN           NaN          NaN
    36           NaN  394000000.0          NaN           NaN          NaN
    46           NaN          NaN          NaN           NaN          NaN
    90           NaN          NaN  383000000.0           NaN          NaN

In [415]:
pivod_df.xs('男')

name,ウソップ,サンジ,ジンベエ,ゾロ,チョッパー,ナミ,フランキー,ブルック,ルフィ,ロビン
age,,,,,,,,,,
17,NaN,NaN,NaN,NaN,1000.0,NaN,NaN,NaN,NaN,NaN
19,500000000.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,3.000000e+09,NaN
21,NaN,1.032000e+09,NaN,1.111000e+09,NaN,NaN,NaN,NaN,NaN,NaN
36,NaN,NaN,NaN,NaN,NaN,NaN,394000000.0,NaN,NaN,NaN
46,NaN,NaN,1.100000e+09,NaN,NaN,NaN,NaN,NaN,NaN,NaN
90,NaN,NaN,NaN,NaN,NaN,NaN,NaN,383000000.0,NaN,NaN

## DataFrameをcsvファイルで保存する

### .to_csv()

In [420]:
df_movies = pd.read_csv('./dataset/tmdb/tmdb_5000_movies.csv')
df_credits = pd.read_csv('./dataset/tmdb/tmdb_5000_credits.csv')
df = df_movies.merge(df_credits, left_on='id', right_on='movie_id', suffixes=['_movies', '_credits'])
df.head(3)

,budget,genres,homepage,id,keywords,original_language,original_title,overview,popularity,production_companies,...,spoken_languages,status,tagline,title_movies,vote_average,vote_count,movie_id,title_credits,cast,crew
0,237000000,"[{""id"": 28, ""name"": ""Action""}, {""id"": 12, ""nam...",http://www.avatarmovie.com/,19995,"[{""id"": 1463, ""name"": ""culture clash""}, {""id"":...",en,Avatar,"In the 22nd century, a paraplegic Marine is di...",150.437577,"[{""name"": ""Ingenious Film Partners"", ""id"": 289...",...,"[{""iso_639_1"": ""en"", ""name"": ""English""}, {""iso...",Released,Enter the World of Pandora.,Avatar,7.2,11800,19995,Avatar,"[{""cast_id"": 242, ""character"": ""Jake Sully"", ""...","[{""credit_id"": ""52fe48009251416c750aca23"", ""de..."
1,300000000,"[{""id"": 12, ""name"": ""Adventure""}, {""id"": 14, ""...",http://disney.go.com/disneypictures/pirates/,285,"[{""id"": 270, ""name"": ""ocean""}, {""id"": 726, ""na...",en,Pirates of the Caribbean: At World's End,"Captain Barbossa, long believed to be dead, ha...",139.082615,"[{""name"": ""Walt Disney Pictures"", ""id"": 2}, {""...",...,"[{""iso_639_1"": ""en"", ""name"": ""English""}]",Released,"At the end of the world, the adventure begins.",Pirates of the Caribbean: At World's End,6.9,4500,285,Pirates of the Caribbean: At World's End,"[{""cast_id"": 4, ""character"": ""Captain Jack Spa...","[{""credit_id"": ""52fe4232c3a36847f800b579"", ""de..."
2,245000000,"[{""id"": 28, ""name"": ""Action""}, {""id"": 12, ""nam...",http://www.sonypictures.com/movies/spectre/,206647,"[{""id"": 470, ""name"": ""spy""}, {""id"": 818, ""name...",en,Spectre,A cryptic message from Bond’s past sends him o...,107.376788,"[{""name"": ""Columbia Pictures"", ""id"": 5}, {""nam...",...,"[{""iso_639_1"": ""fr"", ""name"": ""Fran\u00e7ais""},...",Released,A Plan No One Escapes,Spectre,6.3,4466,206647,Spectre,"[{""cast_id"": 1, ""character"": ""James Bond"", ""cr...","[{""credit_id"": ""54805967c3a36829b5002c41"", ""de..."

In [424]:
len(df)

4803

In [433]:
df = df[~((df['revenue'] == 0) | (df['budget'] == 0))]
len(df)

3229

In [435]:
df['profit'] = df.apply(lambda x: x['revenue'] - x['budget'], axis=1)
df.head(3)

,budget,genres,homepage,id,keywords,original_language,original_title,overview,popularity,production_companies,...,status,tagline,title_movies,vote_average,vote_count,movie_id,title_credits,cast,crew,profit
0,237000000,"[{""id"": 28, ""name"": ""Action""}, {""id"": 12, ""nam...",http://www.avatarmovie.com/,19995,"[{""id"": 1463, ""name"": ""culture clash""}, {""id"":...",en,Avatar,"In the 22nd century, a paraplegic Marine is di...",150.437577,"[{""name"": ""Ingenious Film Partners"", ""id"": 289...",...,Released,Enter the World of Pandora.,Avatar,7.2,11800,19995,Avatar,"[{""cast_id"": 242, ""character"": ""Jake Sully"", ""...","[{""credit_id"": ""52fe48009251416c750aca23"", ""de...",2550965087
1,300000000,"[{""id"": 12, ""name"": ""Adventure""}, {""id"": 14, ""...",http://disney.go.com/disneypictures/pirates/,285,"[{""id"": 270, ""name"": ""ocean""}, {""id"": 726, ""na...",en,Pirates of the Caribbean: At World's End,"Captain Barbossa, long believed to be dead, ha...",139.082615,"[{""name"": ""Walt Disney Pictures"", ""id"": 2}, {""...",...,Released,"At the end of the world, the adventure begins.",Pirates of the Caribbean: At World's End,6.9,4500,285,Pirates of the Caribbean: At World's End,"[{""cast_id"": 4, ""character"": ""Captain Jack Spa...","[{""credit_id"": ""52fe4232c3a36847f800b579"", ""de...",661000000
2,245000000,"[{""id"": 28, ""name"": ""Action""}, {""id"": 12, ""nam...",http://www.sonypictures.com/movies/spectre/,206647,"[{""id"": 470, ""name"": ""spy""}, {""id"": 818, ""name...",en,Spectre,A cryptic message from Bond’s past sends him o...,107.376788,"[{""name"": ""Columbia Pictures"", ""id"": 5}, {""nam...",...,Released,A Plan No One Escapes,Spectre,6.3,4466,206647,Spectre,"[{""cast_id"": 1, ""character"": ""James Bond"", ""cr...","[{""credit_id"": ""54805967c3a36829b5002c41"", ""de...",635674609

In [445]:
profit_sort_df = df.sort_values('profit', ascending=False)

In [446]:
for idx, movie in profit_sort_df.iterrows():
    if movie['vote_average'] > 8:
        print(idx, movie['title_movies'])

329 The Lord of the Rings: The Return of the King
65 The Dark Knight
2912 Star Wars
96 Inception
809 Forrest Gump
1990 The Empire Strikes Back
95 Interstellar
1818 Schindler's List
1553 Se7en
2294 Spirited Away
2091 The Silence of the Lambs
3337 The Godfather
690 The Green Mile
2453 Dead Poets Society
1987 Howl's Moving Castle
3232 Pulp Fiction
2247 Princess Mononoke
3719 One Flew Over the Cuckoo's Nest
662 Fight Club
2731 The Godfather: Part II
2170 Psycho
3573 Memento
2760 Room
3866 City of God
2284 The Shining
3906 The Apartment
1847 GoodFellas
3454 The Usual Suspects
3865 Whiplash
4238 Modern Times
4302 The Good, the Bad and the Ugly
3057 American History X
1881 The Shawshank Redemption
4602 12 Angry Men
3622 Once Upon a Time in the West
4535 Seven Samurai
2947 The Visual Bible: The Gospel of John
2970 There Goes My Baby

In [451]:
profit_sort_df.to_csv('./data/tmdb_5000_movies_profit_sorted.csv', index=False)

In [452]:
df = pd.read_csv('./data/tmdb_5000_movies_profit_sorted.csv')
df.head(3)

,budget,genres,homepage,id,keywords,original_language,original_title,overview,popularity,production_companies,...,status,tagline,title_movies,vote_average,vote_count,movie_id,title_credits,cast,crew,profit
0,237000000,"[{""id"": 28, ""name"": ""Action""}, {""id"": 12, ""nam...",http://www.avatarmovie.com/,19995,"[{""id"": 1463, ""name"": ""culture clash""}, {""id"":...",en,Avatar,"In the 22nd century, a paraplegic Marine is di...",150.437577,"[{""name"": ""Ingenious Film Partners"", ""id"": 289...",...,Released,Enter the World of Pandora.,Avatar,7.2,11800,19995,Avatar,"[{""cast_id"": 242, ""character"": ""Jake Sully"", ""...","[{""credit_id"": ""52fe48009251416c750aca23"", ""de...",2550965087
1,200000000,"[{""id"": 18, ""name"": ""Drama""}, {""id"": 10749, ""n...",http://www.titanicmovie.com,597,"[{""id"": 2580, ""name"": ""shipwreck""}, {""id"": 298...",en,Titanic,"84 years later, a 101-year-old woman named Ros...",100.025899,"[{""name"": ""Paramount Pictures"", ""id"": 4}, {""na...",...,Released,Nothing on Earth could come between them.,Titanic,7.5,7562,597,Titanic,"[{""cast_id"": 20, ""character"": ""Rose DeWitt Buk...","[{""credit_id"": ""52fe425ac3a36847f8017985"", ""de...",1645034188
2,150000000,"[{""id"": 28, ""name"": ""Action""}, {""id"": 12, ""nam...",http://www.jurassicworld.com/,135397,"[{""id"": 1299, ""name"": ""monster""}, {""id"": 1718,...",en,Jurassic World,Twenty-two years after the events of Jurassic ...,418.708552,"[{""name"": ""Universal Studios"", ""id"": 13}, {""na...",...,Released,The park is open.,Jurassic World,6.5,8662,135397,Jurassic World,"[{""cast_id"": 10, ""character"": ""Owen Grady"", ""c...","[{""credit_id"": ""52fe4bf7c3a368484e1a0683"", ""de...",1363528810